#!/bin/bash

sed -i 's/#ParallelDownloads = 5/ParallelDownloads = 10/g' /etc/pacman.conf
loadkeys ru
setfont cyr-sun16

#Синхронизация системных часов
timedatectl set-ntp true
#sleep 1

clear
echo -e '\e[1;34m
                                                                                                        #                                               
                                                                                                       ###                                                   
                                                                                                      #+++#                                                
                                                                                                     +######                                               
                                                                                                    +########                                              
                                                                                                   ##########%                                             
                                                                                                  ##%########%%                                            
                                                                                                  #%%%#####%%%%%                                           
                                                                                                 #%%%###++##%%%%%                                          
                                                                                                #%%%%##++++##%%%%%                                         
                                                                                               #%%%%##+++++##%%%%%#                                        
                                                                                              #%%%%%##++**+###%%%%%%                                       
                                                                                             #%%%%%%###+**+###%%%%%%                                       
                                                                                            #%%%%%%%###+**++###%%%%%@                                      
                                                                                           #%%%%%%%####+**+++###%%%%%@                                     
                                                                                           %%%%%%%%####++**++####%%%%%%                                    
                                                                                         +#%%%%%%######+++*+++####%%%%%%                                   
                                                                                         #%%%#%%%########+++++#####%%%%%%                                  
                                                                                        +%%%%#%%#%%%%%%@@@@%%#######%%%%%%                                 
                                                                                       #%%%%#####%%@@@@@@@@@@@@%%%##%%%%%%%                                
                                                                                      #%%%%%###%%@@@@@@@@@@@@@@@@@%%%%%%%%%#                               
                                                                                    %#%%%%%###%@@@@@@@@@@@@@@@@@@@@@%%%%%%%%%                              
                                                                                   +#%%%%%##%@@@@@@@@@@@@@@@@@@@@@@@@@%%%%%%%%                             
                                                                                  +#%%%%%#%@@@@@@@@@@@@@@@@@@@@@@@@@@@@%%%%%%@#                            
                                                                                 +#%%%%#%@@@@@@@@@@%# #######%@@@@@@@@@@%%%%%%@                            
                                                                                +%%%%%#%@@@@@@@@* *##       ### %@@@@@@@@%%%%%%%                           
                                                                               +%%%%###@@@@@@%  #*%           ##%  %@@@@@@%#%%%%%                          
                                                                              +%%%%#+#@@@@@@   %###            %#%   @@@@@@###%%%%                         
                                                                             +%%%##+#%@@@@%    ##%      __     ###%   %@@@@%###%%%%                        
                                                                            #%%%##++%@@@@%     #### *:*++####  ###%    %@@@@#+##%%%%                       
                                                                          +#%%%##++%@@@@%      ###############*####     %@@@%#+##%%%%                      
                                                                         *#%%%##++#%@@@@    +:++#####       *#####%%#    %@@@%++##%%%%                     
                                                                        *#%%%##++#%%@@@   *#%%%%%%#####%%%######%%%%%%%#  @@@%#++##%%%%                    
                                                                       *%%%%##+++#%@@@% ##@@%# #%@%@%%%   %%%%@#+%  %@@@% %@@%%+++##%%%%                   
                                                                      +%%%%##+++#%%@@@  @@*    %@@  %@%   #@@  @@@     %@% @@%%#+++#%%%%%                  
                                                                     +%%%%%#+*+#%%%@@@ #@       @@@   @@@@@@   @@%      %@ @@%%#+*+##%%%%%                 
                                                                    #%%%%%#+*+#%%@@@@@ %%        @@%   @@@@   @@@        % @@@%%#+++##%%%%%                
                                                                  ##%%%%%#+++%@@@@@@@@  #         %@@@@@@@@%@@@%        ## @@@@@%##%%%%%%%%%               
                                                                 *#%%%%%##%@@@@@@@@@@@  ##           +@@@@@@%           #  @@@@@@@%##%%%%%%%%              
                                                                +#%%%%%%@@@@@@@@@@@@@@%   ##       *%@@@%@@@@@%       ##   @@@@@@@@@%%%%%%#%%%             
                                                               +%%%%%%@@@@@@@@@@@@@@@@%     %@@%%%@@@@%    %@@@@@@%%%%    %@@@@@@@@@@@@%%%%%%%%             
                                                              +%%%%%@@@@@@@@@@@@@@@@@%#                                   @@@@@@@@@@@@@@@%%%%%%#           
                                                             +%%%%@@@@@@@@@@@@@%#                                             @@@@@@@@@@@@@%%%%%%          
                                                            #%%%@@@@@@@@@@@%                                                      %@@@@@@@@@@%%%%%         
                                                          %#%%@@@@@@@@@%                                                              @@@@@@@@@%%%%        
                                                         +#%@@@@@@@@%                                                                    %@@@@@@@%%%%      
                                                        +%@@@@@@@%                                                                           @@@@@@@@%     
                                                       +%@@@@@%#                                                                               @@@@@@@%    
                                                      +%@@@@%                                                                                     @@@@@@   
                                                     %@@@@%                                                                                         @@@@@ 
                                                    @@%%                                                                                              %%@@ \e[0m'
echo -e '\033[32m'
read -p "                                                                                       Введите имя компьютера: " hostname
read -p "                                                                                       Введите имя пользователя: " username
read -p "                                                                                       Введите пароль root: " rootpass
read -p "                                                                                       Введите пароль user: " userpass
export hostname username rootpass userpass

echo -e '\033[32m' &&

  #Создание разделов
wipefs -a /dev/sda
echo -e '\033[32m' &&
(
  echo n;
  echo p;
  echo;
  echo;
  echo;
  echo w;
) | fdisk --color=never /dev/sda

#Ваша разметка диска
echo -e '\e[31m' ; lsblk -f

#Форматирование дисков
echo -e '\033[32m'
mkfs.btrfs -f -L ArchLinux /dev/sda1

#Монтирование дисков
mount -t btrfs /dev/sda1 /mnt
btrfs subvolume create /mnt/@
umount /mnt
mount -t btrfs /dev/sda1 /mnt
btrfs subvolume create /mnt/@home
umount /mnt
mount -t btrfs -o noatime,nodatasum,compress=zstd,ssd,max_inline=0,subvol=@ /dev/sda1 /mnt
mkdir /mnt/home /mnt/boot
mount -t btrfs -o noatime,nodatasum,compress=zstd,ssd,max_inline=0,subvol=@home /dev/sda1 /mnt/home

echo -e '

\e[31m==================================================================================== Установка основных пакетов ==================================\e[0m
'
echo -e '\033[32m'

pacstrap /mnt base base-devel nano linux linux-zen linux-firmware btrfs-progs iwd linux-zen-headers

echo -e '

\e[31m==================================================================================== Настройка системы ===========================================\e[0m
'
echo -e '\033[32m'
genfstab -pU /mnt >> /mnt/etc/fstab

arch-chroot /mnt sh -c "$(curl -fsSL https://raw.githubusercontent.com/DrDiablo87/ArchLinux/refs/heads/master/test1.sh)"
systemctl reboot
